### 데이터프레임 만들기

각각의 column으로 넣기

In [1]:
import pandas as pd

math = ['70', '80', '60', '100','95']
english = ['85', '80', '90', '80','100']
history = ['70', '90','100', '90', '90']

# 1. 각각의 리스트를 데이터프레임으로 만들기.
math_df = pd.DataFrame(math, columns=["수학"])
english_df = pd.DataFrame(english, columns=["영어"])
history_df = pd.DataFrame(history, columns=["역사"])

# 2. 각각의 데이터프레임을 하나로 합치기.
total = pd.concat([math_df,english_df,history_df], axis = 1)
total

    수학   영어   역사
0   70   85   70
1   80   80   90
2   60   90  100
3  100   80   90
4   95  100   90

각각의 row로 넣기

In [2]:
data = [
    ['1000', 'Steve', 90.72], 
    ['1001', 'James', 78.09], 
    ['1002', 'Doyeon', 98.43], 
    ['1003', 'Jane', 64.19], 
    ['1004', 'Pilwoong', 81.30],
    ['1005', 'Tony', 99.14],
]
df = pd.DataFrame(data)
df

      0         1      2
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

컬럼헤더 넣기

In [3]:
df.columns = ['학번','이름','점수']
df

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

인덱스 넣기(로우헤더)

In [5]:
df.index = ['one','two','three','four','five','six']
df

         학번        이름     점수
one    1000     Steve  90.72
two    1001     James  78.09
three  1002    Doyeon  98.43
four   1003      Jane  64.19
five   1004  Pilwoong  81.30
six    1005      Tony  99.14

딕셔너리로 만들기

In [8]:
# 딕셔너리로 생성하기
data = { '학번' : ['1000', '1001', '1002', '1003', '1004', '1005'],
'이름' : [ 'Steve', 'James', 'Doyeon', 'Jane', 'Pilwoong', 'Tony'],
         '점수': [90.72, 78.09, 98.43, 64.19, 81.30, 99.14]}

df = pd.DataFrame(data)
df

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [9]:
df.head(2)

     학번     이름     점수
0  1000  Steve  90.72
1  1001  James  78.09

In [10]:
df.tail(2)

     학번        이름     점수
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [12]:
df['이름']

0       Steve
1       James
2      Doyeon
3        Jane
4    Pilwoong
5        Tony
Name: 이름, dtype: object

In [ ]:
pd.read_sql_query('SELECT * FROM kopo_product_volume', engine_postgresql) # 엔진 이름 : engine_postgresql

In [ ]:
pd.read_sql_table(table_name = selloutTable_st02, con=engine2) # 엔진 이름 : engine2

In [ ]:
pd.read_sql_table()

### kopo_producr_volume0~2 파일을 에러 없이 읽어서 리스트에 저장한다.
### (단, 1번은 제외하고 읽는다)

In [3]:
import pandas as pd    # 판다스를 불러온다.
dataSum = []    # 데이터를 불러와 담을 빈 리스트 생성.
dataFolder = "../exampleCode/dataset/"    # 폴더의 주소를 preFix로 선언.
targetFile = "kopo_product_volume{}.csv"

for i in range(0, 3):
    if i == 1:
        continue
    else:
        dataSum.append(pd.read_csv(dataFolder + targetFile.format(i)))    # ("../exampleCode/dataset/kopo_product_volume{}.csv".format(i)) : {}에 i가 들어간다.
        
dataSum

[    REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
 0        A01       ST0001    201415  810144
 1        A01       ST0002    201415  128999
 2        A01       ST0001    201418  671464
 3        A01       ST0002    201418  134467
 4        A01       ST0001    201413  470040
 ..       ...          ...       ...     ...
 260      A01       ST0002    201614  148835
 261      A01       ST0001    201641  746061
 262      A01       ST0002    201412  151750
 263      A01       ST0001    201420  645626
 264      A01       ST0002    201420  125863

 [265 rows x 4 columns],
     REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
 0        A01       ST0001    201415  810144
 1        A01       ST0002    201415  128999
 2        A01       ST0001    201418  671464
 3        A01       ST0002    201418  134467
 4        A01       ST0001    201413  470040
 ..       ...          ...       ...     ...
 260      A01       ST0002    201614  148835
 261      A01       ST0001    201641  746061
 262      A01       ST0002    201412  151750
 263      A01       ST0001    201420  645626
 264      A01       ST0002    201420  125863

 [265 rows x 4 columns]]

### try 활용하기 : 예외 발생 가능한 로직에 사용

In [13]:
import pandas as pd    # 판다스를 불러온다.
dataSum = []    # 데이터를 불러와 담을 빈 리스트 생성.
dataFolder = "../exampleCode/dataset/"    # 폴더의 주소를 preFix로 선언.
targetFile = "kopo_product_volume{}.csv"

for i in range(0, 3):
    # 예외 발생 가능한 로직.
    try:
        # 데이터파일을 리스트에 추가.
        targetFileAddress = dataFolder + targetFile.format(i)
        load = pd.read_csv(targetFileAddress)
        dataSum.append(load)
    # 예외 발생시 로직.
    except Exception as e:    # 그냥 except pass만 해도 되는데 이 경우 어떤게 오류 났는지를 알 수가 없다. e를 붙여주면 오류를 출력해준다.
        print(e)
        print(targetFileAddress)
        pass
dataSum

[Errno 2] File ../exampleCode/dataset/kopo_product_volume1.csv does not exist: '../exampleCode/dataset/kopo_product_volume1.csv'
../exampleCode/dataset/kopo_product_volume1.csv

[    REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
 0        A01       ST0001    201415  810144
 1        A01       ST0002    201415  128999
 2        A01       ST0001    201418  671464
 3        A01       ST0002    201418  134467
 4        A01       ST0001    201413  470040
 ..       ...          ...       ...     ...
 260      A01       ST0002    201614  148835
 261      A01       ST0001    201641  746061
 262      A01       ST0002    201412  151750
 263      A01       ST0001    201420  645626
 264      A01       ST0002    201420  125863

 [265 rows x 4 columns],
     REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
 0        A01       ST0001    201415  810144
 1        A01       ST0002    201415  128999
 2        A01       ST0001    201418  671464
 3        A01       ST0002    201418  134467
 4        A01       ST0001    201413  470040
 ..       ...          ...       ...     ...
 260      A01       ST0002    201614  148835
 261      A01       ST0001    201641  746061
 262      A01       ST0002    201412  151750
 263      A01       ST0001    201420  645626
 264      A01       ST0002    201420  125863

 [265 rows x 4 columns]]

#### python execption 검색해서 한 번씩 보면 좋다.